# FLYUX 语言语法规范 - 变量与函数定义

**更新日期**: 2025-11-11

## 📌 语法快速参考

### 1. 变量定义

#### 1.1 无类型推断的变量定义
```flyux
a := 123          // 推断为 num 类型
b := "Hello"      // 推断为 str 类型
c := true         // 推断为 bl 类型
d := [1, 2, 3]    // 推断为数组
e := {x: 1, y: 2} // 推断为 obj 类型
f := null         // 类型为 null
g := undef        // 类型为 undef
```

#### 1.2 显式类型定义变量
```flyux
// 格式: 变量名 :[类型]= 初始值
c :[num]= 123.456           // 显式 num 类型的变量
d :[str]= "Hello"           // 显式 str 类型的变量
e :[bl]= true               // 显式 bl 类型的变量
f :[obj]= {aaa: "bbb", ccc: ["ddd", "eee"]}  // 显式 obj 类型
arr :[num]= [1, 2, 3]       // num 类型数组
```

#### 支持的类型
- `num` - 数字（包括整数和浮点数）
- `str` - 字符串
- `bl` - 布尔值（true/false）
- `obj` - 对象 ({key: value, ...})
- `func` - 函数 ((params) => {...})

### 2. 常量定义

#### 格式：`变量名 :(类型)= 值`
```flyux
// 常量必须显式指定类型且必须初始化
PI :(num)= 3.14159
GREETING :(str)= "Hello, World!"
IS_ENABLED :(bl)= true
CONFIG :(obj)= {host: "localhost", port: 8080}
```

**常量特性**：
- ✓ 必须显式指定类型
- ✓ 必须在定义时初始化
- ✗ 定义后不可重新赋值
- ✗ 不可重新定义

### 3. 函数定义

#### 3.1 无类型标注的函数定义
```flyux
// 格式: 函数名 := (参数...) { 函数体 }
add := (a, b) {
    R> a + b
}

main := () {
    // 函数体
}
```

#### 3.2 显式类型标注的函数定义
```flyux
// 格式: 函数名 : (func) = (参数...) { 函数体 }
🤪🫵 : (func) = (🐙, 🍄) {
    R> 🐙 + 🍄 * 🐙
}
```

**注意**：`:=` 后面跟 `(` 的表达式自动推断为函数类型

### 4. 变量赋值/修改 (使用 `=`)

#### 4.1 基本赋值
```flyux
a = 456          // 修改 a 的值
b = "World"      // 修改 b 的值
```

#### 4.2 赋值为 null
```flyux
x = null         // 任何类型变量都可赋值为 null
                 // 此后 x 的值为 null，类型保持不变
```

#### 4.3 赋值为 undef（删除变量）
```flyux
y = undef        // 相当于删除变量 y
                 // 之后访问 y 会出现未定义错误
```

### 5. 控制流语句

#### if 条件语句
```flyux
if (condition) {
    // 真分支
} {
    // 假分支（可选）
}

// 多条件链式
if (a < 10) {
    // 处理 a < 10
} (a < 20) {
    // 处理 a < 20
}
```

#### L> 循环语句
```flyux
// 重复循环
L> [10] {
    // 执行 10 次
}

// for 循环
L> (i := 0; i < 10; i++) {
    // 初始化、条件、更新
}

// 遍历循环
L> (array : item) {
    // 遍历数组的每个元素
}
```

#### R> 返回语句
```flyux
R> value    // 返回值
R>          // 返回 undef (隐式)
```

### 6. 方法调用与属性访问

#### 方法链调用（.>）
```flyux
arr.>length.>🐮🐴(2)       // 函数🐮🐴具有两个参数，.>左边作为第一个参数
obj.>toString.>toUpperCase
```

#### 属性访问（.）
```flyux
obj.property
obj.nestedObj.deepProperty
```

#### 数组/对象索引
```flyux
arr[0]
obj.key
obj["key"]
arr[idx]
```

### 7. 运算符

#### 算术运算符
```flyux
a + b      // 加法
a - b      // 减法
a * b      // 乘法
a / b      // 除法
a % b      // 取模
a ** b     // a的b次方
```

#### 比较运算符
```flyux
a < b      // 小于
a > b      // 大于
a <= b     // 小于等于
a >= b     // 大于等于
a == b     // 等于
a != b     // 不等于

// 支持链式比较
0 < x <= 100    // x 在 0 到 100 之间
```

#### 逻辑运算符
```flyux
a && b     // 逻辑与
a || b     // 逻辑或
!a         // 逻辑非
```

#### 位运算符
```flyux
a & b      // 位与
a | b      // 位或
a ^ b      // 位异或
```

### 8. 字面量

#### 数字字面量
```flyux
123        // 整数
3.14       // 浮点数
-42        // 负数
```

#### 字符串字面量
```flyux
"Hello"                 // 双引号字符串
"Nested \"quote\""      // 转义字符
```

#### 字符字面量
```flyux
'a'        // 单个字符
'\n'       // 转义字符
```

#### 数组字面量
```flyux
[]         // 空数组
[1, 2, 3]  // 数字数组
["a", "b"] // 字符串数组
[1, "a", true, null]  // 混合类型数组
```

#### 对象字面量
```flyux
{}         // 空对象
{ a: 1, b: 2 }                    // 简单对象
{ name: "Alice", age: 30 }        // 字符串键
{ [1]: "value" }                  // 数字键
{ nested: { deep: {value: 42} } }   // 嵌套对象
```

### 9. 关键字与保留字

#### 语言关键字
- `if` - 条件语句
- `L>` - 循环
- `R>` - 返回
- `:=` - 变量/常量定义（推断或显式类型）
- `=` - 赋值
- `.>` - 方法链调用
- `.` - 属性访问
- `:` - 对象键分隔符

#### 保留类型（不能用作变量名）
- `num` - 数字类型
- `str` - 字符串类型
- `bl` - 布尔类型
- `obj` - 对象类型
- `func` - 函数类型

#### 保留字（不能用作变量名）
- `true` - 布尔真
- `false` - 布尔假
- `null` - null 值
- `undef` - undefined 值

### 10. 注释

#### 单行注释
```flyux
// 这是单行注释
a := 123 // 行尾注释
```

#### 多行注释
```flyux
/* 这是多行注释 */
a := /* 中间注释 */ 456
```

---

## 📊 变量定义语法对比

```
无类型推断:           a := 123
显式类型推断:         a :[num]= 123
常量定义:             a :(num)= 123
赋值/修改:            a = 456
null 赋值:            a = null
undef 赋值(删除):      a = undef
```

## 🔄 变量生命周期示例

```flyux
// 1. 定义变量（无类型，推断为 num）
x := 10

// 2. 修改变量
x = 20

// 3. 赋值为 null（值为 null，类型仍为 num）
x = null

// 4. 赋值为 undef（删除变量，再访问会报错）
x = undef

// 5. 重新定义（可以，因为已删除，可重新推断类型）
x := "Hello"
```

## 🎯 函数定义示例

```flyux
// 简单函数
greet := () {
    R> "Hello"
}

// 带参数的函数
add := (a, b) {
    R> a + b
}

// 带返回类型的函数定义
multiply :<num>= (x, y) {
    R> x * y
}

// 主函数
main := () {
    result := add(5, 3)
    print(result)
}
```

---

## ⚠️ 重要规则

1. **类型保留词不能作变量名**
   - ✗ `num := 123` - 错误
   - ✗ `str := "hello"` - 错误
   - ✓ `number := 123` - 正确

2. **变量为null的情况**
   - ✓ `x :[num]` - 无值定义，自动赋值为null
   - ✓ `x :[num]= 3.14` - 重新定义并赋值
   - ✓ `x = 10; x = null` - x 的类型仍为 num，值为null
   - ✓ `x := "hi"; x = null` - x 的类型仍为 str

3. **常量必须初始化**
   - ✗ `PI :(num)` - 错误，缺少值
   - ✓ `PI :(num)= 3.14` - 正确

4. **常量不可重新赋值**
   - ✓ `PI :(num)= 3.14` - 定义
   - ✗ `PI = 3.15` - 错误

5. **函数后跟 `(` 时自动推断为函数类型**
   - ✓ `f := () { R> 1 }` - 自动推断为 func
   - ✓ `g :<num>= () { R> 2 }` - 显式声明

7. **赋值为 undef 相当于删除**
   - ✓ `x := 10; x = undef` - 删除变量 x
   - ✗ 之后访问 x 会报错

---

**文档版本**: 1.0  
**最后更新**: 2025-11-11
