// 测试无类型函数定义语法

// 无参数无类型函数
f1 := () {
    R> 42
}

// 单参数无类型函数
f2 := (x) {
    R> x + 10
}

// 多参数无类型函数
add := (a, b) {
    R> a + b
}

// main 函数（无类型）
main := () {
    result := add(5, 3)
    R> result
}
